rtsbd/scenario3/bookingRQ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rts="http://www.rts.co.kr/">
<soapenv:Header>
   <rts:BaseInfo>
      <!--Optional:-->
      <rts:SiteCode>CTM1X-00</rts:SiteCode>
      <!--Optional:-->
      <rts:Password>test1234</rts:Password>
      <!--Optional:-->
      <rts:RequestType>NetPartner</rts:RequestType>
   </rts:BaseInfo>
</soapenv:Header>
<soapenv:Body>
   <rts:CreateSystemBookingForGuestCount>
      <rts:SystemBookingInfoNetForGuestCount>
         <!--Optional:-->
         <rts:LanguageCode>AR</rts:LanguageCode>
         <!--Optional:-->
         <rts:ClientCurrencyCode>USD</rts:ClientCurrencyCode>
         <!--Optional:-->
         <rts:BookingCode></rts:BookingCode>
         <!--Optional:-->
         <rts:AdminCompCode>RTS32</rts:AdminCompCode>
         <!--Optional:-->
         <rts:GroupOrFit>F</rts:GroupOrFit>
         <!--Optional:-->
         <rts:NationalityCode>EU</rts:NationalityCode>
         <!--Optional:-->
         <rts:TravelerNationality>AR</rts:TravelerNationality>
         <!--Optional:-->
         <rts:SalesCompCode>CTM1X</rts:SalesCompCode>
         <!--Optional:-->
         <rts:SalesSiteCode>CTM1X-00</rts:SalesSiteCode>
         <rts:SalesUserNo>813054</rts:SalesUserNo>
         <!--Optional:-->
         <rts:SalesUserId></rts:SalesUserId>
         <!--Optional:-->
         <rts:SalesUserName></rts:SalesUserName>
         <!--Optional:-->
         <rts:SalesUserGender></rts:SalesUserGender>
         <!--Optional:-->
         <rts:SalesUserBirthday></rts:SalesUserBirthday>
         <!--Optional:-->
         <rts:SalesUserHandPhone></rts:SalesUserHandPhone>
         <!--Optional:-->
         <rts:SalesUserCompPhone></rts:SalesUserCompPhone>
         <!--Optional:-->
         <rts:SalesUserHomePhone></rts:SalesUserHomePhone>
         <!--Optional:-->
         <rts:SalesUserEamil></rts:SalesUserEamil>
         <rts:SalesEmpNo>813054</rts:SalesEmpNo>
         <!--Optional:-->
         <rts:SalesEmpName></rts:SalesEmpName>
         <!--Optional:-->
         <rts:SalesPayStatusCode></rts:SalesPayStatusCode>
         <!--Optional:-->
         <rts:NormalRemarks></rts:NormalRemarks>
         <!--Optional:-->
         <rts:SalesRemarks></rts:SalesRemarks>
         <!--Optional:-->
         <rts:AdminRemarks></rts:AdminRemarks>
         <rts:AdminBlockYn>false</rts:AdminBlockYn>
         <!--Optional:-->
         <rts:BookingPathCode>PATH01</rts:BookingPathCode>
         <rts:CardPaymentYn>false</rts:CardPaymentYn>
         <!--Optional:-->
         <rts:CardPaymentAmount></rts:CardPaymentAmount>
         <rts:LastWriterUno>813054</rts:LastWriterUno>
         <!--Optional:-->
         <rts:CustomerList>
            <!--Zero or more repetitions:-->
            <rts:CustomerInfo>
               <rts:No>1</rts:No>
               <!--Optional:-->
               <rts:Name>Daniel Vinagre</rts:Name>
               <!--Optional:-->
               <rts:LastName>Vinagre</rts:LastName>
               <!--Optional:-->
               <rts:FirstName>Daniel</rts:FirstName>
               <!--Optional:-->
               <rts:Gender>M</rts:Gender>
               <!--Optional:-->
               <rts:Age>30</rts:Age>
               <!--Optional:-->
               <rts:Country></rts:Country>
               <!--Optional:-->
               <rts:Birthday></rts:Birthday>
               <!--Optional:-->
               <rts:JuminNo></rts:JuminNo>
               <rts:LeadYn>false</rts:LeadYn>
               <!--Optional:-->
               <rts:PassportNo></rts:PassportNo>
               <!--Optional:-->
               <rts:PassportExpiry></rts:PassportExpiry>
            </rts:CustomerInfo> 
            <rts:CustomerInfo>
               <rts:No>2</rts:No>
               <!--Optional:-->
               <rts:Name>Lisete Vinagre</rts:Name>
               <!--Optional:-->
               <rts:LastName>Vinagre</rts:LastName>
               <!--Optional:-->
               <rts:FirstName>Lisete</rts:FirstName>
               <!--Optional:-->
               <rts:Gender>F</rts:Gender>
               <!--Optional:-->
               <rts:Age>30</rts:Age>
               <!--Optional:-->
               <rts:Country></rts:Country>
               <!--Optional:-->
               <rts:Birthday></rts:Birthday>
               <!--Optional:-->
               <rts:JuminNo></rts:JuminNo>
               <rts:LeadYn>false</rts:LeadYn>
               <!--Optional:-->
               <rts:PassportNo></rts:PassportNo>
               <!--Optional:-->
               <rts:PassportExpiry></rts:PassportExpiry>
            </rts:CustomerInfo>  
            <rts:CustomerInfo>
               <rts:No>3</rts:No>
               <!--Optional:-->
               <rts:Name>Alexandra Vinagre</rts:Name>
               <!--Optional:-->
               <rts:LastName>Vinagre</rts:LastName>
               <!--Optional:-->
               <rts:FirstName>Alexandra</rts:FirstName>
               <!--Optional:-->
               <rts:Gender>F</rts:Gender>
               <!--Optional:-->
               <rts:Age>6</rts:Age>
               <!--Optional:-->
               <rts:Country></rts:Country>
               <!--Optional:-->
               <rts:Birthday></rts:Birthday>
               <!--Optional:-->
               <rts:JuminNo></rts:JuminNo>
               <rts:LeadYn>false</rts:LeadYn>
               <!--Optional:-->
               <rts:PassportNo></rts:PassportNo>
               <!--Optional:-->
               <rts:PassportExpiry></rts:PassportExpiry>
            </rts:CustomerInfo>     
         </rts:CustomerList>
         <!--Optional:-->
         <rts:BookingHotelList>
            <!--Zero or more repetitions:-->
            <rts:BookingHotelInfo>
               <!--Optional:-->
               <rts:ItemCode>SAO0037</rts:ItemCode>
               <rts:ItemNo>16</rts:ItemNo>
               <!--Optional:-->
               <rts:AgentBookingReference></rts:AgentBookingReference>
               <!--Optional:-->
               <rts:BookerTypeCode>Partner</rts:BookerTypeCode>
               <!--Optional:-->
               <rts:BookingPathCode>PATH01</rts:BookingPathCode>
               <!--Optional:-->
               <rts:AppliedFromDate>2020-04-14</rts:AppliedFromDate>
               <!--Optional:-->
               <rts:AppliedToDate>2020-04-17</rts:AppliedToDate>
               <!--Optional:-->
               <rts:RoomTypeCode>20200416|20200419|W|258|47369|SUI.SU|GAR|BB||1~1~0||N@04~~246c3~-513337453~N~~927FE06EFE78440157909834038802PAAR00000580026000508246c3^20200416|20200419|W|258|47369|SUI.SU|GAR|BB||1~1~1|6|N@04~~246c3~-1117434062~N~~927FE06EFE78440157909834038802PAAR00000580026000508246c3:DJB.EA:suite single twin superior:258|17368|431:A1#B0#C0#D0#E0|DHBRGPB|~Breakfast</rts:RoomTypeCode>
               <!--Optional:-->
               <rts:FreeBreakfastTypeName>Breakfast</rts:FreeBreakfastTypeName>
               <!--Optional:-->
               <rts:AddBreakfastTypeName></rts:AddBreakfastTypeName>
               <rts:VatSheetYn>false</rts:VatSheetYn>
               <!--Optional:-->
               <rts:GuestCountAndGuestList>
                  <!--Zero or more repetitions:-->
                  <rts:GuestCountAndGuestInfo>
                     <rts:RoomNo>1</rts:RoomNo>
                     <rts:AdultCount>1</rts:AdultCount>
                     <rts:ChildCount>0</rts:ChildCount>
                     <!--Optional:-->
                     <rts:GuestList>
                        <!--Zero or more repetitions:-->
                        <rts:GuestInfo>
                           <rts:GuestNo>1</rts:GuestNo>
                           <!--Optional:-->
                           <rts:AgeTypeCode></rts:AgeTypeCode>
                           <!--Optional:-->
                           <rts:ProductId></rts:ProductId>
                        </rts:GuestInfo>                         
                     </rts:GuestList>
                  </rts:GuestCountAndGuestInfo>
                  <rts:GuestCountAndGuestInfo>
                     <rts:RoomNo>2</rts:RoomNo>
                     <rts:AdultCount>1</rts:AdultCount>
                     <rts:ChildCount>1</rts:ChildCount>
                     <!--Optional:-->
                     <rts:GuestList>
                        <!--Zero or more repetitions:-->
                        <rts:GuestInfo>
                           <rts:GuestNo>2</rts:GuestNo>
                           <!--Optional:-->
                           <rts:AgeTypeCode></rts:AgeTypeCode>
                           <!--Optional:-->
                           <rts:ProductId></rts:ProductId>
                        </rts:GuestInfo> 
                        <rts:GuestInfo>
                           <rts:GuestNo>3</rts:GuestNo>
                           <!--Optional:-->
                           <rts:AgeTypeCode></rts:AgeTypeCode>
                           <!--Optional:-->
                           <rts:ProductId></rts:ProductId>
                        </rts:GuestInfo>                        
                     </rts:GuestList>
                  </rts:GuestCountAndGuestInfo>
               </rts:GuestCountAndGuestList>
            </rts:BookingHotelInfo>
         </rts:BookingHotelList>
         <!--Optional:-->
         <rts:SellerMarkup>*1</rts:SellerMarkup>
      </rts:SystemBookingInfoNetForGuestCount>
   </rts:CreateSystemBookingForGuestCount>
</soapenv:Body>
</soapenv:Envelope>